Repository: ptipitaka/_op1
Catalog: locale/*/LC_MESSAGES/django.po
Languages: th

source: Thai
th: ไทย

source: Code
th: รหัส

source: Title
th: หัวเรื่อง

source: Subtitle
th: หัวเรื่องรอง

source: Book cover
th: ปก

source: Total pages
th: จำนวนหน้า

source: Word
th: คำ

source: Burmese
th: พม่า

source: Roman
th: โรมัน

source: Word sequence
th: ลำดับคำ

source: Book
th: หนังสือ

source: Page no
th: เลขหน้า

source: Note
th: บันทึก

source: Action
th: ดำเนินการ

source: Word starts with
th: เริ่มต้นคำด้วย

source: Word contains
th: คำประกอบด้วย

source: Back
th: กลับ

source: Tipiṭaka Pāḷi-Burmese Dictionary
th: อภิธานพระไตรปิฎก บาลี-พม่า

source: Submit
th: ดำเนินการ

source: found
th: พบ

source: record(s)
th: รายการ

source: Change Password
th: เปลี่ยนรหัสผ่าน

source: Save changes
th: บันทึก

source: Powered by
th: สนับสนุนโดย

source: People's Tipiṭaka Foundation
th: มูลนิธิพระไตรปิฎกเพื่อประชาชน

source: The Pāḷi Platform
th: ปาฬิแพลตฟอร์ม

source: Abidan
th: อภิธาน

source: Tipiṭaka
th: พระไตรปิฎก

source: Digital Archive
th: การอนุรักษ์ดิจิทัล

source: Wordlist
th: รายการคำ

source: Table Of Contents
th: สารบัญ

source: Padānukkama
th: ปทานุกรม

source: Project
th: โครงการ

source: Sadda
th: คำศัพท์

source: Literal Translation
th: แปลยกศัพท์

source: Setting
th: กำหนดค่า

source: Nāma
th: นาม

source: Noun Declension
th: วิภัตตินาม

source: Nāmasaddapadamālā
th: แบบวิภัตติบทนาม

source: Akhyāta
th: อาขฺยาต

source: Dhātu
th: ธาตุ

source: Paccaya
th: ปัจจัย

source: Verb Conjugation
th: วิภัตติอาขยาต

source: Login
th: เข้าระบบ

source: Logout
th: ออกระบบ

source: Publication
th: เผยแพร่

source: All Pada
th: บท

source: items
th: รายการ

source: All Sadda
th: ศัพท์

source: Overview of operations
th: ภาพรวมของการดำเนินงาน

source: Overview of the translation process
th: ภาพรวมของกระบวนการแปล

source: The daily progress by date
th: ความคืบหน้าการดำเนินงานรายวัน

source: Wordlist Version
th: เวอร์ชัน รายการคำ

source: Collaborators
th: ผู้ร่วมดำเนินการ

source: Recently Updated
th: ปรับปรุงล่าสุด

source: On Process
th: กำลังดำเนินการ

source: Waiting
th: รอดำเนินการ

source: Log In
th: ออกระบบ

source: Your password was successfully updated!
th: รหัสผ่านของคุณถูกอัปเดตเรียบร้อยแล้ว!

source: Please correct the error
th: กรุณาแก้ไขข้อผิดพลาด

source: Description
th: รายละเอียด

source: NamaSaddamala
th: การจำแนกแบบแจกบทนาม

source: Meaning
th: ความหมาย

source: Form saved successfully.
th: การบันทึกเสร็จสิ้น

source: Form saved unsuccessfully
th: การบันทึกเสร็จสิ้น

source: Form deleted successfully.
th: การบันทึกเสร็จสิ้น

source: Form deleted unsuccessfully
th: การบันทึกเสร็จสิ้น

source: Error: Record deletion unsuccessful
th: พบข้อผิดพลาด การลบรายการเสร็จสิ้น

source: Error: {}-{}, please contact SA
th: พบข้อผิดพลาด

source: Form is invalid. Please correct the errors
th: พบข้อผิดพลาด โปรดติดต่อเจ้าหน้าที่

source: Ekavacana
th: เอกวจนะ

source: Bahuvacana
th: พหุวจนะ

source: Sequence
th: ลำดับ

source: Title order
th: ลำดับตามชื่อเรื่อง

source: Type
th: ประเภท

source: Liṅga
th: ลิงค์

source: Kāranta
th: การันต์

source: Paṭhamā Ekavacana
th: ปฐมา เอกวจนะ

source: Paṭhamā Bahuvacana
th: ปฐมา พหุวจนะ

source: Ālapana Ekavacana
th: อาลปนะ เอกวจนะ

source: Ālapana Bahuvacana
th: อาลปนะ พหุวจนะ

source: Dutiyā Ekavacana
th: ทุติยา เอกวจนะ

source: Dutiyā Bahuvacana
th: ทุติยา เอกวจนะ

source: Tatiyā Ekavacana
th: ตติยะ เอกวจนะ

source: Tatiyā Bahuvacana
th: ตติยะ พหุวจนะ

source: Catutthī Ekavacana
th: จตุตถี เอกวจนะ

source: Catutthī Bahuvacana
th: จตุตถี พหุวจนะ

source: Pañcamī Ekavacana
th: ปัญจมี เอกวจนะ

source: Pañcamī Bahuvacana
th: ปัญจมี พหุวจนะ

source: Chaṭṭhī Ekavacana
th: ฉัฏฐี เอกวจนะ

source: Chaṭṭhī Bahuvacana
th: ฉัฏฐี พหุวจนะ

source: Sattamī Ekavacana
th: สัตตมี เอกวจนะ

source: Sattamī Bahuvacana
th: สัตตมี พหุวจนะ

source: Popularity
th: ความนิยม

source: Meaning (Ekavacana)
th: ตติยะ เอกวจนะ

source: Meaning (Bahuvacana)
th: ตติยะ พหุวจนะ

source: Purisa 1 Parassapada Ekavacana
th: สัตตมี เอกวจนะ

source: Purisa 1 Parassapada Bahuvacana
th: สัตตมี พหุวจนะ

source: Purisa 1 Attanopada Ekavacana
th: สัตตมี เอกวจนะ

source: Purisa 1 Attanopada Bahuvacana
th: สัตตมี พหุวจนะ

source: Purisa 2 Parassapada Ekavacana
th: สัตตมี เอกวจนะ

source: Purisa 2 Parassapada Bahuvacana
th: สัตตมี พหุวจนะ

source: Purisa 2 Attanopada Ekavacana
th: สัตตมี เอกวจนะ

source: Purisa 2 Attanopada Bahuvacana
th: สัตตมี พหุวจนะ

source: Purisa 3 Parassapada Ekavacana
th: สัตตมี เอกวจนะ

source: Purisa 3 Parassapada Bahuvacana
th: สัตตมี พหุวจนะ

source: Purisa 3 Attanopada Ekavacana
th: สัตตมี เอกวจนะ

source: Purisa 3 Attanopada Bahuvacana
th: สัตตมี พหุวจนะ

source: Language
th: ภาษา

source: About
th: เกี่ยวกับ

source: Target Languages
th: ภาษา

source: Table of Contents
th: สารบัญ

source: Structure
th: โครงสร้าง

source: Byaya
th: พฺยย

source: Padanukkama
th: ปทานุกรม

source: Pada sequence
th: ลำดับบท

source: Construction
th: การประกอบคำ

source: State
th: สถานะ

source: Pada
th: บท

source: Word in roman script
th: คำในอักษรโรมัน

source: Parent word
th: จากคำ

source: Word List
th: รายการคำ

source: Translation
th: แปล

source: Sentence
th: ลำดับ

source: Word Sequence
th: ลำดับคำ

source: Word Order by Translation
th: แปลยกศัพท์

source: Definition
th: รายละเอียด

source: title
th: หัวเรื่อง

source: Pañcamī Purisa 1 Parassapada Ekavacana
th: ปัญจมี เอกวจนะ

source: Pañcamī Purisa 1 Parassapada Bahuvacana
th: ปัญจมี พหุวจนะ

source: Pañcamī Purisa 1 Attanopada Ekavacana
th: ปัญจมี เอกวจนะ

source: Pañcamī Purisa 1 Attanopada Bahuvacana
th: ปัญจมี พหุวจนะ

source: Pañcamī Purisa 2 Parassapada Ekavacana
th: ปัญจมี เอกวจนะ

source: Pañcamī Purisa 2 Parassapada Bahuvacana
th: ปัญจมี พหุวจนะ

source: Pañcamī Purisa 2 Attanopada Ekavacana
th: ปัญจมี เอกวจนะ

source: Pañcamī Purisa 2 Attanopada Bahuvacana
th: ปัญจมี พหุวจนะ

source: Pañcamī Purisa 3 Parassapada Ekavacana
th: ปัญจมี เอกวจนะ

source: Pañcamī Purisa 3 Parassapada Bahuvacana
th: ปัญจมี พหุวจนะ

source: Pañcamī Purisa 3 Attanopada Ekavacana
th: ปัญจมี เอกวจนะ

source: Pañcamī Purisa 3 Attanopada Bahuvacana
th: ปัญจมี พหุวจนะ

source: Sattamī Purisa 1 Parassapada Ekavacana
th: สัตตมี เอกวจนะ

source: Sattamī Purisa 1 Parassapada Bahuvacana
th: สัตตมี พหุวจนะ

source: Sattamī Purisa 1 Attanopada Ekavacana
th: สัตตมี เอกวจนะ

source: Sattamī Purisa 1 Attanopada Bahuvacana
th: สัตตมี พหุวจนะ

source: Sattamī Purisa 2 Parassapada Ekavacana
th: สัตตมี เอกวจนะ

source: Sattamī Purisa 2 Parassapada Bahuvacana
th: สัตตมี พหุวจนะ

source: Sattamī Purisa 2 Attanopada Ekavacana
th: สัตตมี เอกวจนะ

source: Sattamī Purisa 2 Attanopada Bahuvacana
th: สัตตมี พหุวจนะ

source: Sattamī Purisa 3 Parassapada Ekavacana
th: สัตตมี เอกวจนะ

source: Sattamī Purisa 3 Parassapada Bahuvacana
th: สัตตมี พหุวจนะ

source: Sattamī Purisa 3 Attanopada Ekavacana
th: สัตตมี เอกวจนะ

source: Sattamī Purisa 3 Attanopada Bahuvacana
th: สัตตมี พหุวจนะ

source: Update
th: ปรับปรุง

source: Title contains
th: หัวเรื่องประกอบด้วย

source: All
th: ทั้งหมด

source: True
th: ใช่

source: False
th: ไม่ใช่

source: Sandhi
th: สนธิ

source: Origin
th: ต้นฉบับ

source: Dupl.
th: สำเนา

source: Do you want to duplicate record of
th: คุณต้องการสำเนารายการของ

source: Do you want to delete record of
th: คุณต้องการสำเนารายการของ

source: Search for Padas that start with these characters
th: ค้นหาบทที่เริ่มต้นด้วยตัวอักษรเหล่านี้

source: Search for Padas that contain these characters
th: ค้นหาบทที่มีตัวอักษรเหล่านี้อยู่ในภายใน

source: Go to the page where this Pada is located
th: ไปยังหน้าที่บทนี้ตั้งอยู่

source: Go to the page of the latest updated Pada
th: ไปยังหน้าของบทที่ได้รับการปรับปรุงล่าสุด

source: Filter Padas that have not been processed.
th: กรองบททั้งหมดที่ยังไม่ดำเนินการ

source: Please select
th: โปรดเลือก

source: Decl.
th: วิภัตติ

source: Translate Sadda
th: แปลศัพท์

source: Related Padas
th: บทที่เกี่ยวข้อง

source: Created by
th: สร้างโดย

source: Created By
th: สร้างโดย

source: Found in Translation
th: พบในการแปล

source: Not Found in Translation
th: ไม่พบในการแปล

source: Not Found in Padanukkama
th: ไม่พบในปทานุกรม

source: Interpolation
th: แทรก

source: Split
th: แยก

source: Merge
th: รวม

source: Backspace
th: ย้อนกลับ

source: +Sentence
th: ตัดประโยค

source: Decoupling
th: แยกความสัมพันธ์

source: Existing sadda found. Do you want to proceed?
th: พบว่ามีศัพท์นี้ในฐานข้อมูล ต้องการดำเนินการต่อหรือไม่?

source: Please verify any potentially incorrect `sadda` or possible declension error, Contact to SA to assistance.
th: กรุณาตรวจสอบคำศัพท์ที่อาจจะไม่ถูกต้อง โปรดติดต่อเจ้าหน้าที่

source: Vibhatti
th: วิภัตติ

source: Paṭhamā
th: ปฐมา

source: Ālapana
th: อาลปนะ

source: Dutiyā
th: ทุติยา

source: Tatiyā
th: ตติยา

source: Catutthī
th: จตุตถี

source: Pañcamī
th: ปัญจมี

source: Chaṭṭhī
th: ฉัฏฐี

source: Sattamī
th: สัตตมี

source: Decoupling pada %%(pada)s with sadda %%(sadda)s. Do you want to proceed?
th: แยกความสัมพันธ์ระหว่างบทกับศัพท์

source: Loading...
th: กำลังดำเนินการ

source: Person
th: บุรุษ

source: Parassapada
th: ปรัสสบท

source: Attanopada
th: อัตตโนบท

source: 1st
th: ที่ 1

source: 2nd
th: ที่ 2

source: 3rd
th: ที่ 3

source: Table
th: ตาราง

source: ID
th: รหัส

source: Embedded code
th: รหัสสำหรับนำไปฝังในเว็บไซด์

source: Click the 'Copy Code' button to copy this displayed code and paste it onto the webpage where you want it to appear.
th: คุณสามารถกดปุ่ม 'สำเนารหัส' เพื่อนำรหัสที่แสดงนี้ไปวางบนหน้าเว็บไซต์ที่ต้องการ

source: Copy Code
th: สำเนารหัส

source: Add
th: เพิ่ม

source: Create
th: สร้าง

source: Delete Literal Translation
th: แปลยกศัพท์

source: Are you sure you want to delete the following Literal Translation?
th: กรุณายืนยันการลบรายการ 'วิภัตติอาขยาต'

source: Wordlist version
th: รุ่นคำศัพท์

source: Save
th: บันทึก

source: Reset
th: รีเซ็ต

source: Order by Translation
th: เรียงคำตามความ

source: Order by Pāḷi
th: เรียงคำตามปาฬิ

source: Pada
th: บท

source: Last update
th: ปรับปรุงล่าสุด

source: Export
th: บันทึกเป็นไฟล์

source: Preview
th: แสดง

source: Closest matching words in Abidan
th: ค้นหาในอภิธาน

source: Closest matching words in Sadda
th: ค้นหาในศัพท์

source: Sondhi
th: สนธิ

source: Common Reference
th: อ้างอิงร่วม

source: Are you sure you want to delete
th: กรุณายืนยันการลบรายการ

source: Confirm Delete
th: กรุณายืนยันการลบรายการ

source: Print
th: พิมพ์

source: Pada related to this Sadda
th: แสดงบทที่แจกวิภัตติแล้ว

source: Form is invalid. Please correct the errors.
th: พบข้อผิดพลาด

source: Are you sure you want to delete this record?
th: กรุณายืนยันการลบรายการ

source: The record has been added!
th: การเพิ่มรายการสำเร็จ

source: The record has been duplicated!
th: การสำเนารายการสำเร็จ

source: Error: Record duplication unsuccessful
th: พบปัญหาในการทำสำเนา

source: The record has been deleted!
th: การลบรายการเสร็จสิ้น

source: Record updated successfully!
th: การบันทึกเสร็จสิ้น

source: Form contains errors. Please correct them.
th: พบข้อผิดพลาด

source: New
th: ใหม่

source: Translated
th: แปล

source: Reviewed
th: ตรวจทาน

source: Approved
th: อนุมัติ

source: Ākhyātasaddapadamālā
th: แบบวิภัตติบทอขยาต

source: Conjugation of
th: วิภัตติ

source: Vattamānā
th: วัตตมานา

source: Parokkhā
th: ปโรกขา

source: Hiyyattanī
th: หิยัตตนี

source: Ajjatanī
th: อัชชัตนี

source: Bhavissanti
th: ภวิสสันติ

source: Kālātipatti
th: กาลาติปัตติ

source: Delete Dhātu
th: ลบธาตุ

source: Are you sure you want to delete the following Dhātu?
th: กรุณายืนยันการลบรายการ 'ธาตุ'

source: Dhātugana
th: ธาตุคณะ

source: sg.
th: เอกวจนะ

source: pl.
th: พหุวจนะ

source: Delete Namasaddamala
th: ลบ นามสทฺทมาลา

source: Are you sure you want to delete the following Namasaddamala?
th: กรุณายืนยันการลบรายการนามสัททมาลา

source: Linga
th: ลิงค์

source: Karanta
th: การันต์

source: Are you sure you want to delete the following Noun Declension?
th: กรุณายืนยันการลบรายการ 'ธาตุ'

source: Delete Verb Conjugation
th: ลบวิภัตติอาขยาต

source: Are you sure you want to delete the following Verb Conjugation?
th: กรุณายืนยันการลบรายการ 'วิภัตติอาขยาต'

source: Django site admin
th: Site admin

source: Django administration
th: ผู้ดูแลระบบ

source: Content
th: เนื้อหา

source: From Position
th: จากพิกัด

source: To Position
th: ถึงพิกัด

source: Script
th: สคริปต์

source: Digitization
th: การแปลงเป็นรูปแบบดิจิทัล

source: Version
th: รุ่น

source: Edition
th: ฉบับ

source: Number
th: ลำดับที่

source: Name
th: ชื่อ

source: Volume
th: เล่ม

source: Page Number
th: หน้า

source: Proof-read
th: พิสูจน์อักษร

source: Position
th: พิกัด

source: Line no
th: บรรทัด

source: Page
th: หน้า

source: Table of contents
th: สารบัญ

source: Roman Script
th: อักษรโรมัน

source: Parent
th: แม่

source: From
th: จาก

source: To
th: ถึง

source: Cancel
th: ยกเลิก

source: Search
th: ค้นหา

source: Add/Update
th: เพิ่ม/ปรับปรุง

source: Overall
th: ภาพรวม

source: Image
th: รูปภาพ

source: Digital Archived
th: อนุรักษ์ดิจิทัล

source: Page No. #
th: เลขหน้า #

source: Vol. #
th: เล่ม #

source: Please select Tipiṭaka edition
th: โปรดเลือกฉบับพระไตรปิฎก

source: Process
th: ดำเนินการ

source: Current Wordlist version
th: รุ่นรายการคำ

source: word(s)
th: คำ

source: Create new version
th: สร้างรุ่นใหม่

source: Are you sure?
th: กรุณายืนยัน

source: Vol No. #
th: เล่มที่ #

source: Line No. #
th: บรรทัดที่ #

source: Update successfully!
th: การปรับปรุงข้อมูลเสร็จสิ้น

source: No common references found
th: ไม่พบ การอ้างอิงร่วม

source: Invalid input. Please correct the errors below
th: พบข้อผิดพลาด
