# ปกติ อักขระบาลี ใช้ symbol หนึ่ง ถีง สอง symbol แทนอักขระ 1 ตัว และปกติเขียนอยู่ในรูปที่หดแล้ว pali_shrink
# แต่ว่า coder จะเห็นเป็น symbol เพียง 1 ตัว
# สร้าง function

'''
  แต่ function ทั้งหมดนี้ ถ้าคำบาลีไม่ถูกไวยากรณ์ ตั้งแต่ ข้อที่ 2 ก็ error ได้
  แต่ถึงไม่ error ก็ไม่แน่ว่า คำนั้นจะถูกหรือไม่
  ดังนั้น ในกรณีนี้ ต้องถือว่าคำนั้นถูกต้องอยู่ก่อน จนกว่า มนุษย์จะตรวจพบ
  1. clean(pali_shrink) คัดอักขระอื่นออกไป
      - ตรวจสอบว่า ถูกไวยากรณ์ของอักขระหรือไม่  ***** ยากมาก ยังไม่ได้ทำ
  2. extract(pali_shrink) ทำให้เป็น list ของอักขระ เพราะบางทีมี 2 symbol
      - วางพยัญชนะ หน้า สระ
      - ประโยชน์ ใช้ในการทำ ตัวรูป
      - ผลลัพธ์ pali_expand เป็น list ของ string
  3. encode(pali_expand) แทน list ของ string ด้วยรหัส
      - พยัญชนะเพียงแค่เอาพินทุออก
      - สระแปลงเป็นตัวเลข 1-8
      - อํ แปลงเป็นเลข 9 เรียงตามความนิยม
      - ประโยชน์เพื่อการเรียงลำดับ และเพื่อประหยัดพื้นที่หน่วยความจำ
      - ผลลัพธ์ pali_code ข้อมูล type sting
  4. decode(pali_code) แปลง pali_code กลับเป็น pali_expand
  5. compress(pali_expand) แปลง pali_expand กลับเป็น pali_shrink
      - วางสระ หน้า หลัง บน ล่าง
'''
from abidan.models import Word

space = '\u0020'      # ช่องว่าง
vw_a = '\u0E30'       # สระ -ะ
hanargasa ='\u0E31'   # ไม้หันอากาศ
_r = '\u0E32'         # สระ -า
_i = '\u0E34'         # สระ -ิ
_e = '\u0E35'         # สระ -ี
_u = '\u0E38'         # สระ -ุ
_uu = '\u0E39'        # สระ -ู
pintu ='\u0E3A'       # จุด พินทุ
_ea = '\u0E40'        # สระ -เ
_o = '\u0E42'         # สระ -โ
niccahit ='\u0E4D'    # นิคคหิต
yamaga ='\u0E4E'      # ตัว ยะมะกะ เขียนแทนจุด ของภาษาบาลี

sarani = ['อ','อา','อิ','อี','อุ','อู','เอ','โอ']
payanchanani = [
  'กฺ','ขฺ','คฺ','ฆฺ','งฺ',
  'จฺ','ฉฺ','ชฺ','ฌฺ','ญฺ',
  'ฏฺ','ฐฺ','ฑฺ','ฒฺ','ณฺ',
  'ตฺ','ถฺ','ธฺ','ทฺ','นฺ',
  'ปฺ','ผฺ','พฺ','ภฺ','มฺ',
  'ยฺ','รฺ','ลฺ','วฺ','สฺ','หฺ','ฬฺ']
aukkrani = sarani + payanchanani + ['อํ']

pali_symbol = 'อ' + _r + _i + _e + _u + _uu + _ea + _o + 'กขคฆงจฉชฌญฏฐฑฒณตถทธนปผพภมยรลวสหฬ' + pintu + niccahit
vowel = ["อ", "อา","อิ","อี","อุ","อู","เอ","โอ","อํ"]


# นำอักขระรูปอื่นออกไป
# ตรวจไวยากรณ์ของการวางอักขระบาลี **ยังไม่ได้ทำในเบื้องต้น
def clean(pali_shrink):
    res = ''
    for x in pali_shrink:
        if x in pali_symbol:
            res += x
    return res

# ขยายบาลีรูปหด เป็น บาลีรูปขยาย pali_shrink => pali_expand โดยข้อมูลเป็น list
# แล้วต้องจัดเรียง พยัญชนะวางอยู่หน้าสระ
# ช่วงทำ จะแทน อ ด้วย อะ แล้วค่อยเหลือ อ ตอนสุดท้าย
def extract(pali_shrink):
    y = pali_shrink + '????'  # เพื่อจะสังเกตุตัวถัดไปอีก 4  ตัว
    res = ''
    i = 0
    while i < len(y)-4:
        w = y[i:i+4]
        # เ หรือ โ ที่ไม่มี อ ตามหลัง
        if w[0] in [_ea, _o] and w[1] != 'อ':
            if w[2] != pintu: # ตุมฺเห, ทฺเว
                res += w[1]+pintu+w[0]+'อ'  # หฺ-เอ, วฺ-เอ
                i+=2
            else: # ตุเมฺห เทฺว คเณฺหยฺย
                res += w[1]+pintu+w[3]+pintu+w[0]+'อ' # มฺ-หฺ-เอ, ทฺ-วฺ-เอ, ณฺ-หฺ-เอ
                i+=4
        # พยัญชนะ (ที่มี อ อิ อุ ตามหลังแต่ไม่ปรากฏ อ)
        elif (w[0] >='ก' and w[0]<='ฬ') and w[1] != pintu:
            res += w[0]+pintu+'อะ'  # ใส่ อ รอไว้ก่อน
            i+=1
        elif(w[0:2]) == 'อํ':
            res += 'อะอํ'
            i+=2
        # ถ้าเป็น 'อิ', 'อุ', 'อู' อยู่หน้า หรือ อยู่กลางแต่ไม่ถูกลบ 'อ'
        elif w[0:2] in ['อา','อิ', 'อุ', 'อู', 'เอ', 'โอ']:
            res += w[0:2]
            i+=2
        # นิคคหิต ต้องแปลงเป็น อํ
        elif w[0] == niccahit:
            res += 'อํ'
            i+=1
        # ถ้าเป็น สระ หลัง  บน ล่าง ให้ลบ สระ ะ ข้างหน้า
        elif w[0] in [_r, _i, _e, _u, _uu]:
            res = res[:-1] + w[0]
            i+=1

        # ถ้าเป็น อ อยู่หน้า ข้างหลังเป็นพยัญชนะ จนถึงสระอีกตัว เพราะข้างหน้าไม่ลบ
        elif w[0] == 'อ' and w[1]<="อ":
            res += 'อะ'
            i+=1
        # เ หรือ โ ที่มี อ ตามหลัง, พยัญชนะสังโยค, pintu
        # นำต่อทีละตัวได้เลย
        else:
            res += w[0]
            i+=1

    # ---- ทำให้เป็น list ของอักขระบาลี ---------------
    pali_expand = []
    for i in range(0, len(res), 2):
        x = res[i:i+2]
        if x == 'อะ':
            pali_expand.append('อ')
        else:
            pali_expand.append(x)
    # ---------------------------------------------

    return pali_expand

# แปลง บาลีรูปขยาย เป็น รหัส pali_expand => pali_code
def encode(pali_expand):
    y = ''
    for x in pali_expand:
        if x in vowel:
            n = vowel.index(x)
            # เปลี่ยน สระ เป็นตัวเลข
            y += str(n)
        else:
            # เอาเฉพาะพยัญชนะ ไม่เอาจุด
            y += x[0]
    return y

# แปลงบาลีรหัส เป็น บาลีรูปขยาย pali_code => pali_expand
def decode(pali_code):
    y = []
    for x in pali_code:
        if x >= '1' and x <= '9':
            y.append(vowel[str(x)])
        else:
            y.append(x+pintu)
    return y

# แปลง บาลีรูปขยาย เป็น บาลีรูปหด  pali_expand => pali_shrink
# ผลลัพธ์จะออกคืนมารูปเดียวเท่านั้น
# ตุมฺเห และ ตุเมฺห กลับเป็น ตุมฺเห
# คณฺเหยฺย และ คเณฺหยฺย กลับเป็น คณฺเหยฺย
def compress(pali_expand):
    last_vowel = ['อ',_r, _i, _e, _u, _uu, niccahit ]
    if len(pali_expand) == 0:
        return []

    y = 'อ' # เดี๋ยวลบออกทีหลัง
    for x in pali_expand:

        #  ตัวสุดท้าย เป็น ตัวสุดท้ายของสระ
        if y[-1] in last_vowel:
            if x == "อํ": # ตามด้วย อํ
                y += str(x[1])
            else: # ตามด้วย พยัญชนะ หรือ สระได้ทั้งนั้น
                y += str(x)

        #  ตัวสุดท้าย เป็น พินทุ แล้ว x เป็น อ
        elif y[-1] == pintu and x == 'อ':
            y = y[:-1]  # ลบ พินทุ  เท่ากับ ลดความยาวไป 1

        #  ตัวสุดท้าย เป็น พินทุ แล้ว x เป็น สระ 2 symbols
        elif y[-1] == pintu and x in vowel:
            if x in [ 'เอ', 'โอ' ]:  # เป็น เอ หรือ โอ
                y = y[:-2] + x[0] + y[-2] # เป็นสระที่ต้องวางหน้า
            else:
                y = y[:-1] + x[1] # เป็น พินทุ ไม่มีทางเจอ อํ
        elif x == "อํ":
            y += niccahit
        else:
            y += x

    return y[1:]  #นำ อ ออกไป
